# plugins/dhikr_data.py

DHIKR_LIST = [
    "✨ | عطّروا أفواهكم بالصلاة على النبي\nاللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ",
    "📿 | سبحان الله وبحمده، سبحان الله العظيم",
    "❤️ | لا إله إلا الله",
    "🌴 | سبحان الله",
    "الحمد لله",
    "الله أكبر",
    "لا حول ولا قوة إلا بالله",
    "استغفر الله العظيم وأتوب إليه",
    "سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر",
    "اللهم إنك عفوٌ تحب العفو فاعفُ عنا",
    "لا إله إلا أنت سبحانك إني كنت من الظالمين",
    "يا حي يا قيوم برحمتك أستغيث",
]
