# plugins/hisn_almuslim_data.py

HISN_ALMUSLIM = {
    "home_enter": {
        "button": "🏡 دعاء دخول المنزل",
        "text": "**دعاء دخول المنزل:**\n\nبِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا."
    },
    "home_exit": {
        "button": "🚪 دعاء الخروج من المنزل",
        "text": "**دعاء الخروج من المنزل:**\n\nبِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ."
    },
    "before_eating": {
        "button": "🍔 دعاء قبل الطعام",
        "text": "**دعاء قبل الطعام:**\n\nبِسْمِ اللهِ، فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ: بِسْمِ اللهِ أَوَّلَهُ وَآخِرَهُ."
    },
    "after_eating": {
        "button": "🍽️ دعاء بعد الطعام",
        "text": "**دعاء بعد الطعام:**\n\nالْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ."
    },
    "getting_dressed": {
        "button": "👕 دعاء لبس الثوب",
        "text": "**دعاء لبس الثوب:**\n\nالْحَمْدُ للهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ."
    },
    "visiting_sick": {
        "button": "🤒 دعاء زيارة المريض",
        "text": "**دعاء زيارة المريض:**\n\nلَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللهُ."
    },
    "sneezing": {
        "button": "🤧 دعاء العطاس",
        "text": "**دعاء العطاس:**\n\nإِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ: الْحَمْدُ للهِ، وَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ: يَرْحَمُكَ اللهُ. فَإِذَا قَالَ لَهُ: يَرْحَمُكَ اللهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ."
    }
}
