# plugins/zakhrafa_data.py

# Zakhrafa styles are now a list of dictionaries.
# Each dictionary has a 'type' and its specific data.
ZAKHRAFA_STYLES = [
    # Type 'map': Replaces each character based on the map
    {
        "type": "map",
        "data": {
            'ا': 'آ', 'أ': 'آ', 'إ': 'آ', 'ب': '̜̌ب', 'ت': 'ﭠ', 'ث': 'ﭥ', 'ج': 'ج', 'ح': 'פ', 'خ': 'خ',
            'د': 'נ', 'ذ': 'ذ', 'ر': 'ر', 'ز': 'ز', 'س': 'س', 'ش': 'ش', 'ص': 'ص', 'ض': 'ض', 'ط': 'ط',
            'ظ': 'ظ', 'ع': 'ع', 'غ': 'غ', 'ف': 'ﭰ', 'ق': 'ﭱ', 'ك': 'ك', 'ل': 'ل', 'م': 'م', 'ن': 'ن',
            'ه': 'ھ', 'و': 'ۅ', 'ي': 'ي', 'ى': 'ى', 'ة': 'ة', 'ؤ': 'ؤ', 'ئ': 'ئ', 'ء': 'ء'
        }
    },
    {
        "type": "map",
        "data": {
            'ا': 'ا', 'أ': 'أ', 'إ': 'إ', 'ب': 'ب̲', 'ت': 'ت̲', 'ث': 'ث̲', 'ج': 'ج̲', 'ح': 'ح̲', 'خ': 'خ̲',
            'د': 'د̲', 'ذ': 'ذ̲', 'ر': 'ر̲', 'ز': 'ز̲', 'س': 'س̲', 'ش': 'ش̲', 'ص': 'ص̲', 'ض': 'ض̲',
            'ط': 'ط̲', 'ظ': 'ظ̲', 'ع': 'ع̲', 'غ': 'غ̲', 'ف': 'ف̲', 'ق': 'ق̲', 'ك': 'ك̲', 'ل': 'ل̲',
            'م': 'م̲', 'ن': 'ن̲', 'ه': 'ه̲', 'و': 'و̲', 'ي': 'ي̲', 'ى': 'ى̲', 'ة': 'ة̲', 'ؤ': 'ؤ̲', 'ئ': 'ئ̲'
        }
    },
    {
        "type": "map",
        "data": {
            'ا': 'ا', 'أ': 'أ', 'إ': 'إ', 'ب': 'ب̈', 'ت': 'ت̈', 'ث': 'ث̈', 'ج': 'ج̈', 'ح': 'ح̈', 'خ': 'خ̈',
            'د': 'د̈', 'ذ': 'ذ̈', 'ر': 'ر̈', 'ز': 'ز̈', 'س': 'س̈', 'ش': 'ش̈', 'ص': 'ص̈', 'ض': 'ض̈',
            'ط': 'ط̈', 'ظ': 'ظ̈', 'ع': 'ع̈', 'غ': 'غ̈', 'ف': 'ف̈', 'ق': 'ق̈', 'ك': 'ك̈', 'ل': 'ل̈',
            'م': 'م̈', 'ن': 'ن̈', 'ه': 'ه̈', 'و': 'و̈', 'ي': 'ي̈', 'ى': 'ى̈', 'ة': 'ة̈', 'ؤ': 'ؤ̈', 'ئ': 'ئ̈'
        }
    },
    
    # Type 'prefix_suffix': Adds text before and after the original text
    {
        "type": "prefix_suffix",
        "prefix": "★·.·´¯`·.·★ ",
        "suffix": " ★·.·´¯`·.·★"
    },
    {
        "type": "prefix_suffix",
        "prefix": "ıllıllı ",
        "suffix": " ıllıllı"
    },
    {
        "type": "prefix_suffix",
        "prefix": "『",
        "suffix": "』"
    },
    {
        "type": "prefix_suffix",
        "prefix": "༺ ",
        "suffix": " ༻"
    }
]
